/**
   开发团队：明日科技
   明日学院网站：www.mingrisoft.com
   统计各数字出现的次数
*/
#include<stdio.h>                                       /*包含头文件*/

int main()                                              /*主函数main*/
{
	int i, a[10], b[10] = { 0 };		/*定义数组*/
	printf("请输入10个0~9的数组元素：\n");
	for (i = 0; i < 10; i++)		/*逐个输入数组元素*/
	{
		scanf("%d", &a[i]);
	}


	/*printf("这个数组元素分别是:\n");
	for (i = 0; i < 10; i++)			   
	{
		printf("%d\t", a[i]);
	}
	*/
	printf("----------------------\n");
	for (i = 0; i < 10; i++)                                   /*循环数组中的每个值*/
		b[a[i]]++;                                      /*统计出现的次数*/
	for (i = 0; i < 10; i++)                                   /*从0-9依次循环*/
		printf("|   %d出现的次数%d     |\n", i, b[i]);              /*显示输出次数结果*/
	printf("----------------------\n");
	return 0;                                           /*程序结束*/
}