/**
   开发团队：明日科技
   明日学院网站：www.mingrisoft.com
   搜狐邮箱登录
*/
#include<stdio.h>
int main()
{
	printf("------------------------------------\n");
	printf("|                                  |\n");
	printf("|        登录搜狐邮箱              |\n");
	printf("|                                  |\n");
	printf("|   -----------------------------  |\n");
	printf("|   | 请输入您的邮箱            |  |\n");
	printf("|   -----------------------------  |\n");
	printf("|                                  |\n");
	printf("|   -----------------------------  |\n");
	printf("|   | 请输入您的密码            |  |\n");
	printf("|   -----------------------------  |\n");
	printf("|                                  |\n");
	printf("|                        忘记密码  |\n");
	printf("|                                  |\n");
	printf("|   -----------------------------  |\n");
	printf("|   |           登录            |  |\n");
	printf("|   -----------------------------  |\n");
	printf("|                                  |\n");
	printf("|   -----------------------------  |\n");
	printf("|   | 还没有搜狐闪电邮?现在注册 |  |\n");
	printf("|   -----------------------------  |\n");
	printf("|                                  |\n");
	printf("------------------------------------\n");
	return 0;
}