/**
   开发团队：明日科技
   明日学院网站：www.mingrisoft.com
   输出4399小游戏登录界面
*/
#include<stdio.h>
int main()
{
	printf("--------    ------------    ------------    --------------\n");
	printf("| 登录 |    | 快速注册 |    | 手机注册 |    | 二维码登录 |\n");
	printf("|       -------------------------------------------------|\n");
	printf("|                                                        |\n");
	printf("|                   ---------- ------------ ------------ |\n");
	printf("| 第三方登录(推荐)  | QQ登录 | | 微信登录 | | 微博登录 | |\n");
	printf("|                   ---------- ------------ ------------ |\n");
	printf("|                                                        |\n");
	printf("|------------------4399账号登录--------------------------|\n");
	printf("|                                                        |\n");
	printf("|        4399用户名：___________                         |\n");
	printf("|              密码：___________                         |\n");
	printf("|                                                        |\n");
	printf("|               自动登录    忘记密码                     |\n");
	printf("|                                                        |\n");
	printf("|        --------         --------                       |\n");
	printf("|        | 登录 |         | 注册 |                       |\n");
	printf("|        --------         --------                       |\n");
	printf("|                                                        |\n");
	printf("----------------------------------------------------------\n");

	return 0;
}